droneshire/ti/controlSUITE/device_support/f2802x/v221/f2802x_examples_drivers/sw_prioritized_interrupts/Example_2802xSWPrioritizedDefaultIsr.c
// Connected to USER8 of CPU (non-maskable):
__interrupt void USER8_ISR(void)     // User Defined trap 8
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    __asm ("      ESTOP0");
    for(;;);
}

// Connected to USER9 of CPU (non-maskable):
__interrupt void USER9_ISR(void)     // User Defined trap 9
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    __asm ("      ESTOP0");
    for(;;);
}

// Connected to USER10 of CPU (non-maskable):
__interrupt void USER10_ISR(void)    // User Defined trap 10
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    __asm ("      ESTOP0");
    for(;;);
}

// Connected to USER11 of CPU (non-maskable):
__interrupt void USER11_ISR(void)    // User Defined trap 11
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    __asm ("      ESTOP0");
    for(;;);
}

// Connected to USER12 of CPU (non-maskable):
__interrupt void USER12_ISR(void)     // User Defined trap 12
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    __asm ("      ESTOP0");
    for(;;);
}

// -----------------------------------------------------------
// PIE Group 1 - MUXed into CPU INT1
// -----------------------------------------------------------
// Connected to PIEIER1_1 (use MINT1 and MG11 masks):
#if (G11PL != 0)
__interrupt void ADCINT1_ISR( void )     // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_1);
    CPU_enableInt(myCpu, CPU_IntNumber_1);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT1);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) ~MG11);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0011;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER1_2 (use MINT1 and MG12 masks):
#if (G12PL != 0)
__interrupt void ADCINT2_ISR( void )    // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_1);
    CPU_enableInt(myCpu, CPU_IntNumber_1);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT1);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) ~MG12);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0012;
    ISRTraceIndex++;

}
#endif


// Connected to PIEIER1_4 (use MINT1 and MG14 masks):
#if (G14PL != 0)
__interrupt void  XINT1_ISR(void)
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_1);
    CPU_enableInt(myCpu, CPU_IntNumber_1);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT1);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) ~MG14);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

      __asm("      NOP");

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0014;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER1_5 (use MINT1 and MG15 masks):
#if (G15PL != 0)
__interrupt void  XINT2_ISR(void)
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_1);
    CPU_enableInt(myCpu, CPU_IntNumber_1);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT1);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) ~MG15);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0015;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER1_6 (use MINT1 and MG16 masks):
#if (G16PL != 0)
__interrupt void  ADCINT9_ISR(void)     // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_1);
    CPU_enableInt(myCpu, CPU_IntNumber_1);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT1);                      // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e) ~MG16);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_1, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0016;
    ISRTraceIndex++;

