droneshire/ti/controlSUITE/device_support/f2802x/v221/f2802x_examples_drivers/sw_prioritized_interrupts/Example_2802xSWPrioritizedDefaultIsr.c
      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0031;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER3_2 (use MINT3 and MG32 masks):
#if (G32PL != 0)
__interrupt void EPWM2_INT_ISR(void)     // EPwm2 Interrupt
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_3);
    CPU_enableInt(myCpu, CPU_IntNumber_3);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT3);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) ~MG32);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0032;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER3_3 (use MINT3 and MG33 masks):
#if (G33PL != 0)
__interrupt void EPWM3_INT_ISR(void)     // EPwm3 Interrupt
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_3);
    CPU_enableInt(myCpu, CPU_IntNumber_3);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT3);                          // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) ~MG33);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0033;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER3_4 (use MINT3 and MG34 masks):
#if (G34PL != 0)
__interrupt void EPWM4_INT_ISR(void)     // EPwm4 Interrupt
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_3);
    CPU_enableInt(myCpu, CPU_IntNumber_3);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT3);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e) ~MG34);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_3, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0034;
    ISRTraceIndex++;

}
#endif

// -----------------------------------------------------------
// PIE Group 4 - MUXed into CPU INT4
// -----------------------------------------------------------

// Connected to PIEIER4_1 (use MINT4 and MG41 masks):
#if (G41PL != 0)
__interrupt void ECAP1_INT_ISR(void)     // eCAP1 Interrupt
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_4);
    CPU_enableInt(myCpu, CPU_IntNumber_4);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT4);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_4, (PIE_InterruptSource_e) ~MG41);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_4, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0041;
    ISRTraceIndex++;

}
#endif

// -----------------------------------------------------------
// PIE Group 5 - MUXed into CPU INT5
// -----------------------------------------------------------

// -----------------------------------------------------------
// PIE Group 6 - MUXed into CPU INT6
// -----------------------------------------------------------

// Connected to PIEIER6_1 (use MINT6 and MG61 masks):
#if (G61PL != 0)
__interrupt void SPIRXINTA_ISR(void)    // SPI-A
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_6);
    CPU_enableInt(myCpu, CPU_IntNumber_6);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT6);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e) ~MG61);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0061;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER6_2 (use MINT6 and MG62 masks):
#if (G62PL != 0)
__interrupt void SPITXINTA_ISR(void)     // SPI-A
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_6);
    CPU_enableInt(myCpu, CPU_IntNumber_6);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT6);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e) ~MG62);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_6, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0062;
    ISRTraceIndex++;

