droneshire/ti/controlSUITE/device_support/f2802x/v221/f2802x_examples_drivers/sw_prioritized_interrupts/Example_2802xSWPrioritizedDefaultIsr.c
}
#endif

// -----------------------------------------------------------
// PIE Group 7 - MUXed into CPU INT7
// -----------------------------------------------------------

// -----------------------------------------------------------
// PIE Group 8 - MUXed into CPU INT8
// -----------------------------------------------------------

// Connected to PIEIER8_1 (use MINT8 and MG81 masks):
#if (G81PL != 0)
__interrupt void I2CINT1A_ISR(void)    // I2C-A
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_8);
    CPU_enableInt(myCpu, CPU_IntNumber_8);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT8);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_8, (PIE_InterruptSource_e) ~MG81);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_8, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0081;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER8_2 (use MINT8 and MG82 masks):
#if (G82PL != 0)
__interrupt void I2CINT2A_ISR(void)     // I2C-A
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_8);
    CPU_enableInt(myCpu, CPU_IntNumber_8);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT8);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_8, (PIE_InterruptSource_e) ~MG82);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_8, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0082;
    ISRTraceIndex++;

}
#endif

// -----------------------------------------------------------
// PIE Group 9 - MUXed into CPU INT9
// -----------------------------------------------------------

// Connected to PIEIER9_1 (use MINT9 and MG91 masks):
#if (G91PL != 0)
__interrupt void SCIRXINTA_ISR(void)     // SCI-A
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_9);
    CPU_enableInt(myCpu, CPU_IntNumber_9);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT9);                          // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e) ~MG91);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0091;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER9_2 (use MINT9 and MG92 masks):
#if (G92PL != 0)
__interrupt void SCITXINTA_ISR(void)     // SCI-A
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_9);
    CPU_enableInt(myCpu, CPU_IntNumber_9);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT9);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e) ~MG92);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_9, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0092;
    ISRTraceIndex++;

}
#endif

// -----------------------------------------------------------
// PIE Group 10 - MUXed into CPU INT10
// -----------------------------------------------------------

/* Uncomment the below ADCINT1_ISR, and ADCINT2_ISR if the
    high priority equivalents in Group 1     are not used.
    Comment out the Group 1 equivalents in this case */
/*
// Connected to PIEIER10_1 (use MINT10 and MG101 masks):
#if (G101PL != 0)
__interrupt void ADCINT1_ISR( void )     // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT10);                         // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG101;   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0101;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER10_2 (use MINT10 and MG102 masks):
#if (G102PL != 0)
__interrupt void ADCINT2_ISR( void )    // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) ~MINT10);                         // Set "global" priority
    PieCtrlRegs.PIEIER10.all &= MG102; // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
	__asm("  NOP");
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0102;
    ISRTraceIndex++;

